{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented changes in ProductShowcase.tsx: replacing the third product card image with a cricket bat asset and updating the fourth card's price to ₹999.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions summarizing each file's role in the Jay Sports application.",
  "frontend/index.css": "Tailwind base/components/utilities import with OKLCH CSS custom property tokens for light and dark themes covering colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell for the Jay Sports React app with SEO meta tags, a favicon, Google Analytics 4 integration, and the root mount div.",
  "frontend/src/App.tsx": "Root React component that renders only the Home page as the sole route.",
  "frontend/src/components/AboutSection.tsx": "About section displaying brand story text, an animated stats grid (years, products, athletes, quality), and a four-column core values grid with Lucide icons.",
  "frontend/src/components/ContactSection.tsx": "Contact section with store address, phone, email, hours, and a validated contact form that shows a success state on submission.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar with the Jay Sports logo image, smooth-scroll section links with active highlighting, and a responsive hamburger mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Product card component with a hover 'Find in Store' overlay that opens a modal directing users to the physical store location via a Google Maps link.",
  "frontend/src/components/ProductShowcase.tsx": "Defines a grid of 6 sports product cards (jersey, shorts, cricket bat, shoes, cap, socks) with prices and badges, rendered using the ProductCard component inside a styled section.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global CSS file that imports Barlow fonts, sets up Tailwind layers, defines CSS custom properties for the brand color tokens, and declares reusable component utility classes like cta-primary and nav-link.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Home.tsx": "Home page composed of a full-screen hero section with CTA buttons and stat badges, followed by Navigation, ProductShowcase, AboutSection, ContactSection, and a Footer.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with brand color tokens, Barlow font families, a brand glow shadow, and fade-up/slide-in keyframe animations.",
  "project_state.json": "Tracks project state at version 3, recording two completed features (cricket bat image swap and price update to ₹999 in ProductShowcase) and two pending action requests for the same changes."
}