{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented methods.",
  "feature_evidence.json": "Feature evidence report mapping the main Jay Sports deployment feature to its relevant frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file for quick reference during build planning.",
  "frontend/index.css": "Defines Tailwind base imports and OKLCH CSS custom property color tokens for both light and dark themes used throughout the app.",
  "frontend/index.html": "HTML entry point with Jay Sports page title, SEO meta tags, favicon referencing the generated logo, and the React root mount div.",
  "frontend/src/App.tsx": "Root React component that renders only the Home page as the sole route.",
  "frontend/src/components/AboutSection.tsx": "About section displaying brand story copy, an animated stats grid (years, products, athletes, quality), and a 4-column core values grid with Lucide icons.",
  "frontend/src/components/ContactSection.tsx": "Contact section with real address, phone, and email details plus a validated contact form that shows a success state on submission.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar featuring the Jay Sports logo image, smooth-scroll section links with active highlighting, and a responsive hamburger mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card displaying an image with hover overlay 'Add to Cart' button, category label, name, price, and an optional badge.",
  "frontend/src/components/ProductShowcase.tsx": "Product showcase section rendering a responsive 3-column grid of six ProductCard components with all prices in Indian Rupees (₹349–₹10,999).",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, defines CSS custom properties for the dark athletic color theme, and declares reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/pages/Home.tsx": "Defines the Home page composed of a full-screen hero section with CTA buttons and stat badges, plus Navigation, ProductShowcase, AboutSection, ContactSection, and a Footer.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with brand colors (oklch), Barlow font families, a glow box-shadow, and fade/slide keyframe animations.",
  "project_state.json": "Tracks the project's versioned state, feature list, architectural notes, and known issues for the Jay Sports retail website build."
}