{
  "kind": "build_request",
  "title": "Replace product image with cricket bat and update price to 999",
  "projectName": "Jay Sports",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the ProductShowcase component, replace the image of the product card at grid position 3 (the element identified by XPath /html[1]/body[1]/div[1]/div[1]/main[1]/section[2]/div[1]/div[2]/div[3]/div[2]/div[1]) with a generated cricket bat image asset (cricket-bat.dim_400x400.png) stored in frontend/public/assets/generated/.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Replace this image by a cricket bat"
        ]
      },
      "acceptanceCriteria": [
        "The product card at position 3 displays a cricket bat image instead of the previous image.",
        "The image renders correctly in the ProductCard component without broken src links.",
        "The cricket bat image file exists at frontend/public/assets/generated/cricket-bat.dim_400x400.png."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the ProductShowcase component, update the price displayed in the product card at grid position 4 (the element identified by XPath /html[1]/body[1]/div[1]/div[1]/main[1]/section[2]/div[1]/div[2]/div[4]/div[3]/p[2]) to 999.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the price to 999"
        ]
      },
      "acceptanceCriteria": [
        "The price shown on the targeted product card reads 999 (or ₹999 / $999 consistent with existing formatting).",
        "No other product card prices are modified.",
        "The change is reflected in the hardcoded product data within ProductShowcase.tsx."
      ]
    }
  ],
  "constraints": [
    "Only the two selected elements (XPath-identified product card image at position 3 and price at position 4) must be changed; all other product cards remain untouched.",
    "Do not modify any immutable frontend paths."
  ],
  "nonGoals": [
    "Adding cart or e-commerce functionality.",
    "Modifying the backend.",
    "Changing any other product card's image or price.",
    "Altering navigation, hero section, about section, or contact section."
  ],
  "imageRequirements": {
    "required": [
      "A clean studio-style cricket bat illustration on a transparent or light neutral background (cricket-bat.dim_400x400.png)"
    ],
    "edits": []
  }
}